# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarReinforcementData..::..Create Method
RebarReinforcementData Class See Also
---
Creates a new instance of RebarReinforcementData, or nullNothingnullptra null reference (Nothing in Visual Basic) if the operation fails.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static RebarReinforcementData Create(
	ElementId rebarId,
	int iEnd
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	rebarId As ElementId, _
	iEnd As Integer _
) As RebarReinforcementData
```

Visual C++
---
```text
public:
static RebarReinforcementData^ Create(
	ElementId^ rebarId,
	int iEnd
)
```

# ### Parameters
rebarId
    Type: Autodesk.Revit.DB..::..ElementId the Id of the rebar
iEnd
    Type: System..::..Int32 The end of rebar where the coupler stays. This should be 0 or 1
# ### Return Value
Creates a new instance of RebarReinforcementData
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace